app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "あああ"], ["email", "aaaa"], ["updated_at", "2021-07-19 11:44:56.273592"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def correct_user
      @user = User.find(params[:id])